{
  "contactus.description": "¿Tienes preguntas, necesitas ayuda o quieres hablar sobre Stylo?",
  "contactus.join": "Descubre el foro de ayuda",
  "contactus.mailto": "Contactar con la Cátedra",
  "contactus.publishing": "¿Eres una revista que desea usar Stylo?",
  "contactus.title": "Contáctanos",
  "hero.description": "También es un proyecto de investigación realizado por el equipo de la Cátedra de Investigación de Canadá sobre Escrituras Digitales.",
  "hero.main": "Stylo es un editor de texto semántico y colaborativo, creado para escribir textos científicos.",
  "news.publications.title": "Publicaciones",
  "news.release.title": "Última actualización",
  "news.title": "Noticias",
  "news.workshops.title": "Próximos talleres",
  "project.features": [
    "Lenguajes de marcado ligeros (Markdown, YAML);",
    "Paleta de comandos y atajos de teclado;",
    "Copia de seguridad automática y sistema de versionado de documentos;",
    "Espacios de trabajo compartidos y escritura colaborativa;",
    "Previsualización y anotación web de un artículo;",
    "Gestor de bibliografía (BibTeX) y sincronización con Zotero;",
    "Gestor de metadatos y acceso a datos con la API Graph QL;", 
    "Exportación de artículos en PDF, HTML, XML, LaTeX, ODT;",
    "Creación, manipulación y exportación de un corpus de artículos."
  ],
  "project.features.title": "Características",
  "project.research": "Stylo es un proyecto de investigación y una herramienta prototipo adaptada para revistas en Ciencias Sociales y Humanidades. Integra toda la cadena editorial en un mismo entorno. La circulación de textos digitales se facilita separando la estructura semántica de los documentos de su formato, sin software ni formatos propietarios.",
  "project.title": "El proyecto",
  "project.tool": "Stylo es un editor de texto semántico, libre y colaborativo, basado en <strong>estándares abiertos</strong>. Permite producir <strong>múltiples salidas</strong> a partir de un solo documento o un corpus. Se basa en formatos y tecnologías de conversión utilizadas por la comunidad científica."
}
