{
  "contactus.description": "Do you have questions, need help, or willing to open a conversation about Stylo?",
  "contactus.join": "Join the Stylo community message board",
  "contactus.mailto": "Contact the Laboratory",
  "contactus.publishing": "Are you a publication that wants to use Stylo?",
  "contactus.title": "Contact us",
  "hero.description": "It is also a research project carried out by the team of the Research Laboratory on Digital Textualities.",
  "hero.main": "Stylo is a semantic and collaborative text editor, created for writing scientific texts.",
  "news.publications.title": "Publications",
  "news.release.title": "Latest update",
  "news.title": "News",
  "news.workshops.title": "Upcoming workshops",
  "project.features": [
    "Lightweight markup languages (Markdown, YAML);",
    "Command palette and keyboard shortcuts;",
    "Automatic document backup and a versioning system;",
    "Shared workspaces and collaborative writing;",
    "Web preview, sharing and article annotation;",
    "Bibliography manager (BibTeX) and synchronisation with Zotero;",
    "Metadata manager and access to data via the Graph QL API;",
    "Export of articles in PDF, HTML, XML, LaTeX, ODT;",
    "Creation, manipulation, and export of a corpus of articles."
  ],
  "project.features.title": "Features",
  "project.research": "Stylo is a research project and a prototype tool adapted for journals in the Humanities and Social Sciences. It integrates the entire editorial chain into a single environment. The circulation of digital texts is facilitated by separating the semantic structure of documents from their formatting, without proprietary formats or software.",
  "project.title": "The project",
  "project.tool": "Stylo is a semantic, open-source, and collaborative text editor based on <strong>open standards</strong>. It allows the production of <strong>multiple outputs</strong> from a single document or corpus. It is based on formats and conversion technologies used by the scientific community."
}
